src/test/testtool/RaadpleegMetBurgerservicenummer/02/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
	<soapenv:Body>
		<BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
			xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310"
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<BG:stuurgegevens>
				<StUF:berichtcode>La01</StUF:berichtcode>
				<StUF:zender>
					<StUF:organisatie>test1</StUF:organisatie>
					<StUF:applicatie>test123</StUF:applicatie>
				</StUF:zender>
				<StUF:ontvanger>
					<StUF:organisatie>0518</StUF:organisatie>
					<StUF:applicatie>LBA</StUF:applicatie>
				</StUF:ontvanger>
				<StUF:tijdstipBericht>20241014193050762</StUF:tijdstipBericht>
				<StUF:crossRefnummer>af20ca23-3955-4406-89d2-3048f0017564</StUF:crossRefnummer>
				<StUF:entiteittype>NPS</StUF:entiteittype>
			</BG:stuurgegevens>
			<BG:parameters>
				<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
				<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
				<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
			</BG:parameters>
			<BG:antwoord>
				<BG:object StUF:entiteittype="NPS">
					<BG:inp.bsn>999993628</BG:inp.bsn>
					<BG:inp.a-nummer>3461805105</BG:inp.a-nummer>
					<BG:geslachtsnaam>Huijgen</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorletters>G.</BG:voorletters>
					<BG:voornamen>Geertje</BG:voornamen>
					<BG:aanduidingNaamgebruik>V</BG:aanduidingNaamgebruik>
					<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
					<BG:geboortedatum>19010613</BG:geboortedatum>
					<BG:inp.geboorteplaats>Huisseling en Neerloon</BG:inp.geboorteplaats>
					<BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
					<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.overlijdenplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.overlijdenLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:verblijfsadres>
						<BG:aoa.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
						<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
						<BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
						<BG:aoa.woonplaatsWaarinGelegen>
							<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
							<BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
						</BG:aoa.woonplaatsWaarinGelegen>
						<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
						<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
						<BG:gor.openbareRuimteNaam>Nieuwe Parklaan</BG:gor.openbareRuimteNaam>
						<BG:gor.straatnaam>Nieuwe Parklaan</BG:gor.straatnaam>
						<BG:aoa.postcode>2597LD</BG:aoa.postcode>
						<BG:aoa.huisnummer>58</BG:aoa.huisnummer>
						<BG:aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:begindatumVerblijf>20040404</BG:begindatumVerblijf>
					</BG:verblijfsadres>
					<BG:inp.adresHerkomst>W</BG:inp.adresHerkomst>
					<BG:inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.gemeenteVanInschrijving>0518</BG:inp.gemeenteVanInschrijving>
					<BG:inp.datumInschrijving>20040404</BG:inp.datumInschrijving>
					<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT">
						<BG:gerelateerde StUF:entiteittype="NAT">
							<BG:code>0001</BG:code>
							<BG:omschrijving>Nederlandse</BG:omschrijving>
						</BG:gerelateerde>
						<BG:inp.redenVerkrijging>001</BG:inp.redenVerkrijging>
						<BG:inp.datumVerkrijging>19010613</BG:inp.datumVerkrijging>
					</BG:inp.heeftAlsNationaliteit>
				</BG:object>
			</BG:antwoord>
		</BG:npsLa01>
	</soapenv:Body>
</soapenv:Envelope>